# Desafio 1

Para esse desafio, vamos trabalhar com o data set [Black Friday](https://www.kaggle.com/mehdidag/black-friday), que reúne dados sobre transações de compras em uma loja de varejo.

Vamos utilizá-lo para praticar a exploração de data sets utilizando pandas. Você pode fazer toda análise neste mesmo notebook, mas as resposta devem estar nos locais indicados.

> Obs.: Por favor, não modifique o nome das funções de resposta.

## _Set up_ da análise

In [1]:
import pandas as pd
import numpy as np

In [2]:
black_friday = pd.read_csv("black_friday.csv")

## Inicie sua análise a partir daqui

In [3]:
df = black_friday

In [4]:
df.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969

In [9]:
# OBSERVAÇÃO E COLUNAS PARA Q1
Q1 = df.shape

In [11]:
df.columns

Index(['User_ID', 'Product_ID', 'Gender', 'Age', 'Occupation', 'City_Category',
       'Stay_In_Current_City_Years', 'Marital_Status', 'Product_Category_1',
       'Product_Category_2', 'Product_Category_3', 'Purchase'],
      dtype='object')

In [13]:
df.Age.unique()

array(['0-17', '55+', '26-35', '46-50', '51-55', '36-45', '18-25'],
      dtype=object)

In [12]:
df.dtypes

User_ID                         int64
Product_ID                     object
Gender                         object
Age                            object
Occupation                      int64
City_Category                  object
Stay_In_Current_City_Years     object
Marital_Status                  int64
Product_Category_1              int64
Product_Category_2            float64
Product_Category_3            float64
Purchase                        int64
dtype: object

In [24]:
Q2 = df[(df['Gender'] == 'F') & (df['Age'] == '26-35')]

In [25]:
Q2.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
47,1000011,P00192642,F,26-35,1,C,1,0,8,17.0,NaN,6171
48,1000011,P00110842,F,26-35,1,C,1,0,1,2.0,5.0,19327
49,1000011,P00189642,F,26-35,1,C,1,0,8,13.0,NaN,8027
124,1000024,P00346642,F,26-35,7,A,3,1,8,NaN,NaN,2230
125,1000024,P00205642,F,26-35,7,A,3,1,5,8.0,NaN,6940

In [32]:
Q2_ans = Q2.User_ID.nunique()

In [33]:
Q2_ans

545

In [34]:
Q3 = df.User_ID.nunique()

In [35]:
Q3

5891

In [36]:
Q4 = df.dtypes.nunique()

In [37]:
Q4

3

In [64]:
Q5 = (len(df) - len(df.dropna()))/len(df)

In [80]:
Q6 = df.isna().sum().max()

373299

In [89]:
Q7 = df.Product_Category_3.mode()[0]

In [90]:
Q7

16.0

In [104]:
norm = (df['Purchase'] - df['Purchase'].min()) / (df['Purchase'].max() - df['Purchase'].min())

In [106]:
df["norma"]= norm

In [107]:
df.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase,norma
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370,0.344255
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200,0.631519
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422,0.052027
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057,0.036676
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969,0.327389

In [115]:
normaa = (df['Purchase'] - df['Purchase'].mean())/ df['Purchase'].std()

In [122]:
df['normal'] = normaa

In [123]:
df.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase,norma,normal
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370,0.344255,-0.193506
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200,0.631519,1.177698
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422,0.052027,-1.588401
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057,0.036676,-1.661679
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969,0.327389,-0.274012

In [124]:
Q9 = df[df.normal.between(-1,1)]

In [127]:
Q9.normal.count()

348631

In [149]:
tabela = df[df['Product_Category_2'].isna() ]

In [154]:
tabela2 = tabela.Product_Category_3

In [155]:
tabela2.head(20)

0    NaN
2    NaN
4    NaN
9    NaN
11   NaN
12   NaN
21   NaN
22   NaN
23   NaN
26   NaN
31   NaN
32   NaN
34   NaN
35   NaN
40   NaN
45   NaN
61   NaN
63   NaN
70   NaN
86   NaN
Name: Product_Category_3, dtype: float64

In [159]:
Q10 = tabela1.isna().count() == tabela2.isna().count()

True

In [131]:
tabela

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase,norma,normal
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370,0.344255,-0.193506
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422,0.052027,-1.588401
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969,0.327389,-0.274012
9,1000005,P00274942,M,26-35,20,A,1,1,8,NaN,NaN,7871,0.323267,-0.293687
11,1000005,P00014542,M,26-35,20,A,1,1,8,NaN,NaN,3957,0.158647,-1.079469
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
537563,1004736,P00154642,M,18-25,20,A,1,1,8,NaN,NaN,6074,0.247687,-0.654456
537565,1004736,P00051142,M,18-25,20,A,1,1,8,NaN,NaN,7934,0.325917,-0.281039
537566,1004736,P00048742,M,18-25,20,A,1,1,5,NaN,NaN,5350,0.217236,-0.799808
537568,1004736,P00250642,M,18-25,20,A,1,1,11,NaN,NaN,5930,0.241630,-0.683366
537575,1004737,P00285842,M,36-45,16,C,1,0,5,NaN,NaN,7172,0.293868,-0.434019

In [135]:
tabela['Product_Category_2'] == tabela['Product_Category_3']

0         False
2         False
4         False
9         False
11        False
          ...
537563    False
537565    False
537566    False
537568    False
537575    False
Length: 166986, dtype: bool

## Questão 1

Quantas observações e quantas colunas há no dataset? Responda no formato de uma tuple `(n_observacoes, n_colunas)`.

In [ ]:
def q1():
    Q1 = df.shape
    return Q1
    pass

## Questão 2

Há quantas mulheres com idade entre 26 e 35 anos no dataset? Responda como um único escalar.

In [ ]:
def q2():
    Q2 = df[(df['Gender'] == 'F') & (df['Age'] == '26-35')]
    Q2_ans = Q2.User_ID.nunique()
    return Q2_ans
    pass

## Questão 3

Quantos usuários únicos há no dataset? Responda como um único escalar.

In [ ]:
def q3():
    Q3 = df.User_ID.nunique()
    return Q3
    pass

## Questão 4

Quantos tipos de dados diferentes existem no dataset? Responda como um único escalar.

In [ ]:
def q4():
    Q4 = df.dtypes.nunique()
    return Q4
    pass

## Questão 5

Qual porcentagem dos registros possui ao menos um valor null (`None`, `ǸaN` etc)? Responda como um único escalar entre 0 e 1.

In [ ]:
def q5():
    Q5 =(len(df) - len(df.dropna()))/len(df)
    return Q5
    pass

## Questão 6

Quantos valores null existem na variável (coluna) com o maior número de null? Responda como um único escalar.

In [ ]:
def q6():
    Q6 = df.isna().sum().max()
    return Q6
    pass

## Questão 7

Qual o valor mais frequente (sem contar nulls) em `Product_Category_3`? Responda como um único escalar.

In [ ]:
def q7():
    Q7 = df.Product_Category_3.mode()[0]
    return Q7
    pass

## Questão 8

Qual a nova média da variável (coluna) `Purchase` após sua normalização? Responda como um único escalar.

In [ ]:
def q8():
    norm = (df['Purchase'] - df['Purchase'].min()) / (df['Purchase'].max() - df['Purchase'].min())
    Q8 = np.mean(norm)
    return Q8
    pass

## Questão 9

Quantas ocorrências entre -1 e 1 inclusive existem da variáel `Purchase` após sua padronização? Responda como um único escalar.

In [ ]:
def q9():
    normaa = (df['Purchase'] - df['Purchase'].mean())/ df['Purchase'].std()
    df['normal'] = normaa
    Q9 = df[df.normal.between(-1,1)]
    Res = Q9.normal.count()
    return Res
    pass

## Questão 10

Podemos afirmar que se uma observação é null em `Product_Category_2` ela também o é em `Product_Category_3`? Responda com um bool (`True`, `False`).

In [ ]:
def q10():
    tabela = df[df['Product_Category_2'].isna()]
    tabela1 = tabela['Product_Category_2']
    tabela2 = tabela['Product_Category_3']
    Q10 = tabela1.isna().count() == tabela2.isna().count() 
    return Q10
    pass